/* *********   
 
 This file is only needed if you are defining a custom importer attribute.  
 Most importer plugins will not need to do this.  
 Add this file to your project's localized resources if you have defined a custom attribute. 
 
 
 *********   */

/* Attribute short names That will be presented to the user
 *
 * In the form of
 * Attribute.ShortName
 * "." is not a valid character in an Attribute name.
 * These strings should all be sort and 1 word with no spaces in them.
 */


/* Localized DisplayNames for your custom metadata attributes */
/* The form is:  "myMetadataKey" = "My Metadata Key";    */
/* The name on the left is the name defined in schema.xml */
/* The name on the right is what the user will see */
/* the shortname is a name that users can use in the spotlight search in top right of the computer */
/* eg to look for kMDItemOMUserTags files a user would type tag:foobar */

"info_v002_synopsis_descriptors" = "Synopsis Decriptors";
"info_v002_synopsis_descriptors.Description" = "A standard list of image descriptiors, including dominant colors )White, Grey, Gray, Black, Red, Green, Blue, Cyan, Magenta, Yellow, Organge, Purple, Brown), motion ";
"info_v002_synopsis_descriptors.ShortName" = "Descriptors";

/*"kMDItemOMUserTags" = "TagsOM";
"kMDItemOMUserTags.Description" = "Tags set on a file by a user (Open Meta)";
"kMDItemOMUserTags.ShortName" = "tags_om";

"kMDItemOMUserTagTime" = "Tag Time";
"kMDItemOMUserTagTime.Description" = "Last time tags were changed on a document (Open Meta)";
"kMDItemOMUserTagTime.ShortName" = "tagtime";

"kMDItemOMDocumentDate" = "Content Date";
"kMDItemOMDocumentDate.Description" = "Date of content creation (Open Meta)";
"kMDItemOMDocumentDate.ShortName" = "contentDate,date";

"kMDItemOMBookmarks" = "Bookmarks";
"kMDItemOMBookmarks.Description" = "URLs or bookmark names set on a file by a user (Open Meta)";
"kMDItemOMBookmarks.ShortName" = "bookmark";

"kMDItemOMUserTagApplication" = "Tagging Application";
"kMDItemOMUserTagApplication.Description" = "The application that added the tags or other metadata (Open Meta)";
"kMDItemOMUserTagApplication.ShortName" = "taggedBy";

"kMDItemOMManaged" = "Managed Document";
"kMDItemOMManaged.Description" = "This document is to be handled with document managment systems (Open Meta)";
"kMDItemOMManaged.ShortName" = "managed";
*/
